models/User.php

    public static function findIdentity($id)
    {
        return self::findOne($id);
---
SELECT * FROM `user` WHERE `id`=2

    public static function findByUsername($username)
    {
       return self::findOne(['username'=> $username]);
---
SELECT * FROM `user` WHERE `username`='nikita'